app/views/users/show.html.erb

SELECT "completedsurveys".* FROM "completedsurveys" WHERE "completedsurveys"."survey_id" = $1  [["survey_id", 1]]
---
  <%= sur.title %><br>
  <% sur.completedsurveys.each do |csurvey|%>