app/views/surveys/show.html.erb

<br>
<% @survey.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  ORDER BY created_at desc  [["survey_id", 3]]