app/controllers/choices_controller.rb

SELECT "choices".* FROM "choices"
---
  def index
    @choices = Choice.all

INSERT INTO "choices" ("content", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "yep adf"], ["question_id", 1], ["created_at", "2015-06-21 00:33:33.044224"], ["updated_at", "2015-06-21 00:33:33.044224"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", nil]]
---
  def create
    @choice = Choice.new(choice_params)
    if @choice.save
    user = User.find(session[:user_id])
    user.choices << @choice
    question = Question.find_by(id: params[:question_id])

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT 1  [["id", nil]]
---
  def show
    @choice = Choice.find(params[:id])

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT 1  [["id", 2]]
---
  def edit
    @choice = Choice.find(params[:id])

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "choices" SET "content" = $1, "updated_at" = $2 WHERE "choices"."id" = $3  [["content", "udafkjaldfasdf"], ["updated_at", "2015-06-21 00:43:22.417165"], ["id", 5]]
---
  def update
    @choice = Choice.find(params[:id])
    @choice.assign_attributes(choice_params)
    if @choice.save

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "choices" WHERE "choices"."id" = $1  [["id", 2]]
---
  def destroy
    @choice = Choice.find(params[:id])
    @choice.destroy