app/controllers/completedsurveys_controller.rb

SELECT "completedsurveys".* FROM "completedsurveys"
---
  def index
    @completedsurveys = Completedsurvey.all

INSERT INTO "completedsurveys" ("taker_id", "survey_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["taker_id", 1], ["survey_id", 1], ["created_at", "2015-06-21 01:42:11.634587"], ["updated_at", "2015-06-21 01:42:11.634587"]]
---
  def create
    @completedsurvey = Completedsurvey.create(taker_id: session[:user_id], survey_id: params[:survey_id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @survey = Survey.find(params[:survey_id])