app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)
    if @question.save
      survey = Survey.find_by(creator_id: session[:user_id])
---
INSERT INTO "questions" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "fucking survey gorilla?"], ["created_at", "2015-06-20 23:38:56.947840"], ["updated_at", "2015-06-20 23:38:56.947840"]]
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."creator_id" = $1 LIMIT 1  [["creator_id", 1]]

  def update
    @question = Question.find(params[:id])
    @survey = @question.survey_id
    @question.update(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "content" = $1, "survey_id" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["content", "julias"], ["survey_id", 0], ["updated_at", "2015-06-21 17:58:14.426200"], ["id", 10]]