app/controllers/questions_controller.rb

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."creator_id" = $1 LIMIT 1  [["creator_id", 1]]
---
  def update
    @question = Question.find(params[:id])
    survey = Survey.find_by(creator_id: session[:user_id])