app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test survey"], ["description", "blah blah blah"], ["created_at", "2015-06-20 23:12:28.183875"], ["updated_at", "2015-06-20 23:12:28.183875"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @survey = Survey.new(survey_params)
    if @survey.save
      user = User.find(session[:user_id])

SELECT "questions".* FROM "questions"
SELECT "choices".* FROM "choices"
---
  def new
    @survey = Survey.new
    @questions = Question.all
    @choices = Choice.all

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  ORDER BY created_at desc  [["survey_id", 1]]
SELECT "choices".* FROM "choices"
---
  def edit
    @survey = Survey.find(params[:id])
    @questions = @survey.questions.order("created_at desc")
    @choices = Choice.all

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = $1  ORDER BY created_at desc  [["survey_id", 3]]
SELECT "choices".* FROM "choices"
---
  def show
    @survey = Survey.find(params[:id])
    @questions = @survey.questions.order("created_at desc")
    @choices = Choice.all

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "surveys" SET "title" = $1, "updated_at" = $2 WHERE "surveys"."id" = $3  [["title", "99999999"], ["updated_at", "2015-06-20 23:16:39.388159"], ["id", 3]]
---
  def update
    survey = Survey.find(params[:id])
    survey.assign_attributes(survey_params)
    if survey.save

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "surveys" WHERE "surveys"."id" = $1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 6]]
---
  def destroy
    survey = Survey.find(params[:id])
    survey.destroy
    survey.questions.destroy_all